ACL

Router(config)# ip access-list extended name
Router(config-ext-nacl)# permit udp source wildcard destination wildcard eq isakmp

R1(config)# ip access-list extended INBOUND 
R1(config-ext-nacl)# permit ip 192.168.1.0 0.0.0.255  10.0.1.0 0.0.0.255 
R1(config-ext-nacl)# permit icmp host 172.30.2.2 host 172.30.2.1

R1(config-ext-nacl)# permit udp host 172.30.2.2 host 172.30.2.1 eq isakmp
R1(config-ext-nacl)# permit esp host 172.30.2.2 host 172.30.2.1 
R1(config-ext-nacl)# permit ahp host 172.30.2.2 host 172.30.2.1

R1(config-ext-nacl)# deny ip any any 
R1(config-ext-nacl)# exit 

R1(config)# interface serial0/0/0
R1(config-if)# ip access-group INBOUND in

R1# show crypto isakmp default policy 

OBSERVACOES

R1(config)# crypto isakmp policy 1
R1(config-isakmp)# ? 

ISAKMP commands:
  authentication   Set authentication method for protection suite
  default          Set a command to its defaults 
  encryption       Set encryption algorithm for protection suite 
  exit             Exit from ISAKMP protection suite configuration mode 
  group            Set the Diffie-Hellman group
  hash             Set hash algorithm for protection suite 
  lifetime         Set lifetime for ISAKMP security association
  no               Negate a command or set its defaults]]>

Hash
Authentication
Group
Lifetime
Encryption

POLITICA ISAKMP

R1(config)# crypto isakmp policy 1
R1(config-isakmp)# encryption aes 256
R1(config-isakmp)# hash sha
R1(config-isakmp)# authentication pre-share
R1(config-isakmp)# group 24
R1(config-isakmp)# lifetime 3600
R1(config-isakmp)# end

R1# show crypto isakmp policy 
R1# do show crypto isakmp default policy 

CHAVE PRE COMPARTILHADA

Router(config)# crypto isakmp key keystring address peer-address
Router(config)# crypto isakmp key keystring hostname peer-hostname

R1# conf t 
R1(config)# crypto isakmp key cisco12345 address 172.30.2.2 
R1(config)#
R2# conf t
R2(config)# crypto isakmp key cisco12345 address 172.30.2.1
R2(config)#

TRAFEGO INTERESSANTE

R1# conf t
R1(config)# access-list 101 permit ip 10.0.1.0 0.0.0.255 192.168.1.0 0.0.0.255
R1(config)#
R2# conf t
R2(config)# access-list 102 permit ip 192.168.1.0 0.0.0.255 10.0.1.0 0.0.0.255

R1(config)# crypto ipsec transform-set R1-R2 ?
  ah-md5-hmac      AH-HMAC-MD5 transform
  ah-sha-hmac      AH-HMAC-SHA transform
  ah-sha256-hmac   AH-HMAC-SHA256 transform
  ah-sha384-hmac   AH-HMAC-SHA384 transform
  ah-sha512-hmac   AH-HMAC-SHA512 transform
  comp-lzs         IP Compression using the LZS compression algorithm
  esp-3des         ESP transform using 3DES(EDE) cipher (168 bits)
  esp-aes          ESP transform using AES cipher
  esp-des          ESP transform using DES cipher (56 bits)
  esp-gcm          ESP transform using GCM cipher
  esp-gmac         ESP transform using GMAC cipher
  esp-md5-hmac     ESP transform using HMAC-MD5 auth
  esp-null         ESP transform w/o cipher
  esp-seal         ESP transform using SEAL cipher (160 bits)
  esp-sha-hmac     ESP transform using HMAC-SHA auth
  esp-sha256-hmac  ESP transform using HMAC-SHA256 auth
  esp-sha384-hmac  ESP transform using HMAC-SHA384 auth
  esp-sha512-hmac  ESP transform using HMAC-SHA512 auth

R1(config)# crypto ipsec transform-set R1-R2 esp-aes esp-sha-hmac 
R1(config)#
R2(config)# crypto ipsec transform-set R1-R2 esp-aes esp-sha-hmac 
R2(config)#

MAPA CRYPTO

R1(config)# crypto map R1-R2_MAP 10 ipsec-isakmp
% NOTE: This new crypto map will remain disabled until a peer
        and a valid access list have been configured.
R1(config-crypto-map)# match address 101 
R1(config-crypto-map)# set transform-set R1-R2
R1(config-crypto-map)# set peer 172.30.2.2
R1(config-crypto-map)# set pfs group24
R1(config-crypto-map)# set security-association lifetime seconds 900 
R1(config-crypto-map)# exit
R1(config)#

R2(config)# crypto map R1-R2_MAP 10 ipsec-isakmp
R2(config-crypto-map)# match address 102
R2(config-crypto-map)# set transform-set R1-R2
R2(config-crypto-map)# set peer 172.30.2.1
R2(config-crypto-map)# set pfs group24
R2(config-crypto-map)# set security-association lifetime seconds 900
R2(config-crypto-map)# exit
R2(config)#

R1# show crypto map
Crypto Map IPv4 "R1-R2_MAP" 10 ipsec-isakmp
    Peer = 172.30.2.2
    Extended IP access list 101
        access-list 101 permit ip 10.0.1.0 0.0.0.255 192.168.1.0 0.0.0.255
    Security association lifetime: 4608000 kilobytes/900 seconds
    Responder-Only (Y/N): N
    PFS (Y/N): Y
    DH group:  group24
    Mixed-mode : Disabled
    Transform sets={ 
            R1-R2:  { esp-aes esp-sha-hmac  } , 
    }
    Interfaces using crypto map R1-R2_MAP:
                   
R1#

APLICAR MAPA CRYPTO 

R1(config)# interface serial0/0/0
R1(config-if)# crypto map R1-R2_MAP
R1(config-if)#
*Mar 19 19:36:36.273: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is ON
R1(config-if)# end
R1# show crypto map
Crypto Map IPv4 "R1-R2_MAP" 10 ipsec-isakmp
          Peer = 172.30.2.2
          Extended IP access list 101
              access-list 101 permit ip 10.0.1.0 0.0.0.255 192.168.1.0 0.0.0.255
          Security association lifetime: 4608000 kilobytes/900 seconds
          Responder-Only (Y/N): N
          PFS (Y/N): Y
          DH group:  group24
          Mixed-mode : Disabled
          Transform sets={ 
                  R1-R2:  { esp-aes esp-sha-hmac  } , 
          }
          Interfaces using crypto map R1-R2_MAP:
                  Serial0/0/0

show crypto isakmp sa 
show crypto ipsec sa
